Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.IsDataCompleted
Is the required data completed for this zone equipment?
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.AirSystemId
The air system used for this zone equipment, if applicable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.VRFLoopId
The Varible Refrigerant Flow loop for the VRF fan coil equipment type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.ChilledWaterLoopId
The chilled water loop used for the chilled water option of cooling coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CondenserWaterLoopId
The condenser water loop used for the direction expansion water cooled option of cooling coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HotWaterLoopId
The water loop element id for the hot-water heating coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CoolingCoilType
The type of cooling coil. Note this property change would reset the chilled water loop.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HeatingCoilType
The type of heating coil. Note this property change would reset the hot water loop.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentBehavior
The behavior of how zone equipment is allocated with assigned spaces.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentType
The type of zone equipment. Note this property would reset other properties.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData
Represents the data and parameters of analytical zone equipment.
Since:
2020.1